Core/src/Documents/ДокументЗапроса/ДокументЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументЗапроса</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РегистрДокументЗапроса</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СостоянияДокументЗапроса</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказшик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментИспольнитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретРедактированияДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередатьВЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/ДокументЗапроса/ManagerModule.bsl
Функция  ПечататьДокументЗапрос(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДокументЗапроса";
	Макет = Документы.ДокументЗапроса.ПолучитьМакет("ПечатьДокументЗапрос");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗапасыШапка = Макет.ПолучитьОбласть("ЗапасыШапка");
	ОбластьЗапасы = Макет.ПолучитьОбласть("Запасы");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();
	
	
	
	Для Каждого ДокументЗапроса Из МассивОбъектов Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументЗапроса.Дата,
		|	ДокументЗапроса.ДепартаментИспольнитель,
		|	ДокументЗапроса.Заказшик,
		|	ДокументЗапроса.Номер,
		|	ДокументЗапроса.Организация,
		|	ДокументЗапроса.Проект,
		|	ДокументЗапроса.СтруктурнаяЕдиница,
		|	ДокументЗапроса.Запасы.(
		|		Номенклатура,
		|		ЕдиницаИзмерения,
		|		Количество,
		|		ДатаДоставки
		|	)
		|ИЗ
		|	Документ.ДокументЗапроса КАК ДокументЗапроса
		|ГДЕ
		|	ДокументЗапроса.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", ДокументЗапроса
		);
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		
		
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			
			
			ЛоготипЗаполнен = ЗначениеЗаполнено(Выборка.Организация.ФайлЛоготип);
			Если ЛоготипЗаполнен Тогда
				ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Выборка.Организация.ФайлЛоготип);
				Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
					Шапка.Рисунки.Логотип.Картинка = Новый Картинка(ДанныеКартинки);
				КонецЕсли;
			КонецЕсли;
			
			
			
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьЗапасыШапка);
			ВыборкаЗапасы = Выборка.Запасы.Выбрать();
			Пока ВыборкаЗапасы.Следующий() Цикл
				ОбластьЗапасы.Параметры.Заполнить(ВыборкаЗапасы);
				ТабДок.Вывести(ОбластьЗапасы, ВыборкаЗапасы.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			Подвал.Параметры.ПодписьМОЛ = Выборка.ДепартаментИспольнитель.ПодписьМОЛ.РасшифровкаПодписи;
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
	КонецЦикла;	
	Возврат ТабДок;

	//}}
КонецФункции



// Процедура печати документа.
//
Функция Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ИзРМК = Ложь) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокументЗапрос") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьДокументЗапрос", "Печать Документ Запрос", ПечататьДокументЗапрос(МассивОбъектов, ОбъектыПечати, "Печать Документ Запрос"));
		
	КонецЕсли;
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецФункции // Печать()

// Заполняет список команд печати Заказа покупателя
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьДокументЗапрос";
	КомандаПечати.Представление = НСтр("ka='მოთხოვნის დოკუმენტი';ru='Документ Запрос';en='Requested document'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры
